app/controllers/admin/apis_controller.rb

  def create
    if @api.save
---
INSERT INTO `apis` (`consume_type`, `created_at`, `doc_id`, `http_method`, `note`, `path`, `produce_type`, `resource_id`, `response_class`, `sort`, `summary`, `updated_at`) VALUES ('none', '2015-03-08 14:05:10', 1, 'get', '', '/product/{id}', 'application/json', 1, NULL, NULL, '', '2015-03-08 14:05:10')

  def update
    @api.send params[:sort] if params[:sort]
    if @api.update_attributes params[:api]
---
UPDATE `apis` SET `produce_type` = 'application/json', `response_class` = 'Product', `updated_at` = '2015-03-07 14:35:49' WHERE `apis`.`id` = 1