app/controllers/admin/docs_controller.rb

INSERT INTO `docs` (`api_key`, `api_key_name`, `api_version`, `caption`, `cooperated_users_count`, `created_at`, `description`, `fqdn`, `name`, `request_path`, `subdomain`, `updated_at`, `user_id`) VALUES ('', '', '1.0', '', 0, '2015-02-23 13:21:59', 'test', '', 'test', 'http://test', '2ee889', '2015-02-23 13:21:59', 2)
---
  def create
    @doc = current_user.docs.new(params[:doc])
    if @doc.save

UPDATE `docs` SET `fqdn` = 'api.example.com', `updated_at` = '2015-02-23 14:41:10' WHERE `docs`.`id` = 1
---
  def update
    if @doc.update_attributes params[:doc]