app/controllers/admin/models_controller.rb

  def create
    if @model.save
---
INSERT INTO `models` (`created_at`, `description`, `doc_id`, `name`, `updated_at`) VALUES ('2015-02-23 13:23:11', '', 1, 'Product', '2015-02-23 13:23:11')

  def destroy
    @model.destroy
---
DELETE FROM `models` WHERE `models`.`id` = 7