app/controllers/admin/resources_controller.rb

  def create
    if @resource.save
---
INSERT INTO `resources` (`created_at`, `description`, `doc_id`, `name`, `sort`, `updated_at`) VALUES ('2015-02-23 13:22:43', 'product', 1, 'Product', 1, '2015-02-23 13:22:43')

  def destroy
    @resource.destroy
---
DELETE FROM `resources` WHERE `resources`.`id` = 1