app/views/admin/resources/show.html.haml

  %tbody
    - @resource.apis.each do |api|
---
SELECT `apis`.* FROM `apis` WHERE `apis`.`resource_id` = 1 ORDER BY sort ASC