app/controllers/docs_controller.rb

  def show
    @doc = Doc.find_by_name params[:name]
---
SELECT `docs`.* FROM `docs` WHERE `docs`.`name` = 'test' LIMIT 1