app/controllers/resources_controller.rb

  def show
    @resource = @doc.resources.find_by_name params[:name]
---
SELECT `resources`.* FROM `resources` WHERE `resources`.`doc_id` = 1 AND `resources`.`name` = 'Product' ORDER BY sort ASC LIMIT 1